FKDD_COPY_DIFF_3_2026-02-13/Documents/ТТ_План_ЗП_Фин.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТ_План_ЗП_Фин</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТТ_ПланыЗП_ФИН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Планы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БрендыДляРасчетаЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыОСАГО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Премия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыСтраховки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрограммаСтрахования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрограммыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтрахования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтрахования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховаяКомпания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ТТ_ВариантыСтрахователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПремии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыБанки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Банк</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Банки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПланыПролонгация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Фин</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ТТ_План_ЗП_Фин/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = Движения.ТТ_ПланыЗП_Фин;
	
	Для каждого Стр из Планы Цикл     //АВ КВ
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=ЭтотОбъект;
		НоваяЗапись.Сотрудник=Стр.Сотрудник;
		НоваяЗапись.Бренд=Стр.Бренд;
		НоваяЗапись.Параметр=Перечисления.ТТ_Параметры_ЗП_Фин.АВКВ;
		НоваяЗапись.Организация=Стр.Организация;
		НоваяЗапись.Значение=Стр.Значение;
		НоваяЗапись.Премия=Стр.Премия;
	КонецЦикла;
	
	Для каждого Стр из ПланыОСАГО Цикл     //ОСАГО шт
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=ЭтотОбъект;
		НоваяЗапись.Сотрудник=Стр.Сотрудник;
		НоваяЗапись.Параметр=Перечисления.ТТ_Параметры_ЗП_Фин.ОСАГО;
		НоваяЗапись.Значение=Стр.Значение;
		НоваяЗапись.Премия=Стр.Премия;
	КонецЦикла;

	
	Для каждого Стр из ПланыСтраховки Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=ЭтотОбъект;
		НоваяЗапись.Сотрудник=Стр.Сотрудник;
		НоваяЗапись.Параметр=Стр.Параметр;
		
		НоваяЗапись.ПрограммаСтрахования=Стр.ПрограммаСтрахования;
		НоваяЗапись.СтраховаяКомпания=Стр.СтраховаяКомпания;
		НоваяЗапись.ВидСтрахования=Стр.ВидСтрахования;

		НоваяЗапись.Значение=Стр.Значение;
		НоваяЗапись.Премия=Стр.СуммаПремии;
	КонецЦикла;
	
	Для каждого Стр из ПланыБанки Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=ЭтотОбъект;
		НоваяЗапись.Сотрудник=Стр.Сотрудник;
		НоваяЗапись.Параметр=Стр.Параметр;
		
		НоваяЗапись.Банк=Стр.Банк;

		НоваяЗапись.Значение=Стр.Значение;
		НоваяЗапись.Премия=Стр.СуммаВыдачи;
	КонецЦикла;
	
	
	Для каждого Стр из ПланыПролонгация Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период=Дата;
		НоваяЗапись.Регистратор=ЭтотОбъект;
		НоваяЗапись.Сотрудник=Стр.Сотрудник;
		НоваяЗапись.Параметр=Перечисления.ТТ_Параметры_ЗП_Фин.Пролонгация;
		НоваяЗапись.Значение=Стр.Значение;
	КонецЦикла;

	НаборЗаписей.Записать();

	
КонецПроцедуры
